#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/yushin-private/aws-mlops/runs/run-d9KjuUQQGAnpnjQK

Waiting for the plan to start...

Terraform v1.0.5
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
random_string.suffix: Refreshing state... [id=PvJaEFg9]
module.eks.aws_iam_role.cluster[0]: Refreshing state... [id=mlops-eks20210824020807836000000001]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-075b2168a8a54d959]
module.eks.aws_iam_policy.cluster_elb_sl_role_creation[0]: Refreshing state... [id=arn:aws:iam::112227029085:policy/mlops-eks-elb-sl-role-creation20210824020808104000000002]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy[0]: Refreshing state... [id=mlops-eks20210824020807836000000001-20210824020808291300000004]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSServicePolicy[0]: Refreshing state... [id=mlops-eks20210824020807836000000001-20210824020808309600000005]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSVPCResourceControllerPolicy[0]: Refreshing state... [id=mlops-eks20210824020807836000000001-20210824020808271700000003]
module.eks.aws_iam_role_policy_attachment.cluster_elb_sl_role_creation[0]: Refreshing state... [id=mlops-eks20210824020807836000000001-20210824020808509500000006]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0b18743b4b7302c8f]
aws_security_group.worker_group_mgmt_one: Refreshing state... [id=sg-00a9df337c017e67f]
module.eks.aws_security_group.workers[0]: Refreshing state... [id=sg-0d0307e16b9073558]
aws_security_group.worker_group_mgmt_two: Refreshing state... [id=sg-081c66a871fd32313]
aws_security_group.all_worker_mgmt: Refreshing state... [id=sg-034198ad97290fcd6]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-06028b53eb644fe96]
module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-0959be01b385f8ab0]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0a134ea213c4bf0e2]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-02b7b75b8875b6f02]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-02d825833703ae3e8]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0374fd609632adf7d]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-06dff361d9daa34ea]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0aff3cd4393d112eb]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-073345847327cab44]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-00dd6ad17f28e0110]
module.eks.aws_security_group_rule.workers_ingress_self[0]: Refreshing state... [id=sgrule-3917066488]
module.eks.aws_security_group_rule.workers_egress_internet[0]: Refreshing state... [id=sgrule-1251082616]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-02d825833703ae3e81080289494]
module.eks.aws_security_group_rule.cluster_egress_internet[0]: Refreshing state... [id=sgrule-1926091329]
module.eks.aws_security_group_rule.cluster_https_worker_ingress[0]: Refreshing state... [id=sgrule-561204012]
module.eks.aws_security_group_rule.workers_ingress_cluster[0]: Refreshing state... [id=sgrule-599376673]
module.eks.aws_security_group_rule.workers_ingress_cluster_https[0]: Refreshing state... [id=sgrule-3847001575]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-051a53cf34f3bab1d]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-029613a7fdccb2696]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0ba0c71fe59a51981]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-05b5a62b36b141900]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-08033d4efa6dd5d4d]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-04417febfdd4b1957]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-07bcd2960e6d0ee52]
module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=mlops-eks]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-06028b53eb644fe961080289494]
module.eks.local_file.kubeconfig[0]: Refreshing state... [id=e15d63c247d7a52a2f70afe97cf76e25db9bcf02]
module.eks.aws_iam_role.workers[0]: Refreshing state... [id=mlops-eks20210824021922484200000009]
module.eks.aws_iam_role_policy_attachment.workers_AmazonEKSWorkerNodePolicy[0]: Refreshing state... [id=mlops-eks20210824021922484200000009-2021082402192299810000000c]
module.eks.aws_iam_role_policy_attachment.workers_AmazonEKS_CNI_Policy[0]: Refreshing state... [id=mlops-eks20210824021922484200000009-2021082402192300010000000e]
module.eks.aws_iam_instance_profile.workers[0]: Refreshing state... [id=mlops-eks2021082402192288320000000a]
module.eks.aws_iam_instance_profile.workers[1]: Refreshing state... [id=mlops-eks2021082402192289060000000b]
module.eks.aws_iam_role_policy_attachment.workers_AmazonEC2ContainerRegistryReadOnly[0]: Refreshing state... [id=mlops-eks20210824021922484200000009-2021082402192299960000000d]
module.eks.aws_launch_configuration.workers[1]: Refreshing state... [id=mlops-eks-worker-group-22021082402192332450000000f]
module.eks.aws_launch_configuration.workers[0]: Refreshing state... [id=mlops-eks-worker-group-120210824021923324500000010]
module.eks.aws_autoscaling_group.workers[0]: Refreshing state... [id=mlops-eks-worker-group-120210824021938282500000011]
module.eks.aws_autoscaling_group.workers[1]: Refreshing state... [id=mlops-eks-worker-group-220210824021938292400000012]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.eks.local_file.kubeconfig[0] has been deleted
  - resource "local_file" "kubeconfig" {
      - content              = <<-EOT
            apiVersion: v1
            preferences: {}
            kind: Config
            
            clusters:
            - cluster:
                server: https://0F5C250AF28638C8C818D1C9031677F6.gr7.ap-southeast-2.eks.amazonaws.com
                certificate-authority-data: LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUM1ekNDQWMrZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJeE1EZ3lOREF5TVRRMU5Wb1hEVE14TURneU1qQXlNVFExTlZvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBTUJYCi95eGczN2NwVWo4SE0wSFhyV3ZvSXh5bTRWMmlIaXBRWkpYRDdKV0hyUzdpdGtiTHppZnBCOXE2MXRreHg2SXgKb1JaeHhSaXZKWlBReWl5R3A4TlBYVHZQL2Rxc1lTdjZRZUlQRFY3cnhzZWlDNVZvU0dJRzZIYklSTDFENnJXWgozSmZJNnhnVFZDN0tOZDhnandNS05mcjREb3ZUVjRvLzZnaWtsTyt0aHRtWER0MlVUYzdvNzJZU3RaK3VoWFF4ClhrRWIxUGlGcW0zd0duS3IvaHNYNzRVSnRJL3dya0N3RnI4cW9QR1NwaUhrN01jV05kT1VSZXRPY2NZUlI4aFEKVHR2eG53c3BhL1hBdU9qcWZWNzIrSEVYMytSSFVhY0hMU3Q0TjFOOUpwZzlzcDVTVHdnclNyWDNibDJqUDhFVQo0SVFYdzNzbTFwNFVCNjRsaGhVQ0F3RUFBYU5DTUVBd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0hRWURWUjBPQkJZRUZBazNVV0szTVRHbmFvd2J2RTNuOHUrbXRDMzBNQTBHQ1NxR1NJYjMKRFFFQkN3VUFBNElCQVFDcUNmdkpsN29YQmZ1WFRSeWF1VXFYZmZER1RmYVBrTUc1VFdIcEl4bXNzN1VnSzJJOApxekJSTDlPUGJhcHh2TUNZRFNhKzBrcjlVKytjK3lqS00vYms0RURsajI3NldheXBpb2VhV2NTYTZHMGRWRXQ2Ck1hUWM0anVId1I3RldEbkhnbDhTYTJvOXJIeW8vOXcwY05RYkFwNjhkNFJXTDNQNGhJbE1sV2hCR3ZNWmxZazIKWUtvd3hLUHlPNStiY3NNaXIyMWZHcmUra2laV2U4T05PTk1QeDlSZldyaENZZ1NhV1dwbzlOc2Eybk1NbzFOQQpjemVjeU5HTTJudWdXSGdxWkxUbUYwY25KVzQ3OFRSNkIwLzJVMkp2OTlGVS9uR3hzYWk0OUlFSnNoY0hkVUowCkZwQUtET2txbmlaME9nQVRGWG9JN3MwQjB5QkNpZm8xWC9YNAotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg==
              name: eks_mlops-eks
            
            contexts:
            - context:
                cluster: eks_mlops-eks
                user: eks_mlops-eks
              name: eks_mlops-eks
            
            current-context: eks_mlops-eks
            
            users:
            - name: eks_mlops-eks
              user:
                exec:
                  apiVersion: client.authentication.k8s.io/v1alpha1
                  command: aws-iam-authenticator
                  args:
                    - "token"
                    - "-i"
                    - "mlops-eks"
        EOT -> null
      - directory_permission = "0755" -> null
      - file_permission      = "0600" -> null
      - filename             = "./kubeconfig_mlops-eks" -> null
      - id                   = "e15d63c247d7a52a2f70afe97cf76e25db9bcf02" -> null
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_eks_cluster.cluster will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster" "cluster"  {
      ~ arn                       = "arn:aws:eks:ap-southeast-2:112227029085:cluster/mlops-eks" -> (known after apply)
      ~ certificate_authority     = [
          - {
              - data = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUM1ekNDQWMrZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJeE1EZ3lOREF5TVRRMU5Wb1hEVE14TURneU1qQXlNVFExTlZvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBTUJYCi95eGczN2NwVWo4SE0wSFhyV3ZvSXh5bTRWMmlIaXBRWkpYRDdKV0hyUzdpdGtiTHppZnBCOXE2MXRreHg2SXgKb1JaeHhSaXZKWlBReWl5R3A4TlBYVHZQL2Rxc1lTdjZRZUlQRFY3cnhzZWlDNVZvU0dJRzZIYklSTDFENnJXWgozSmZJNnhnVFZDN0tOZDhnandNS05mcjREb3ZUVjRvLzZnaWtsTyt0aHRtWER0MlVUYzdvNzJZU3RaK3VoWFF4ClhrRWIxUGlGcW0zd0duS3IvaHNYNzRVSnRJL3dya0N3RnI4cW9QR1NwaUhrN01jV05kT1VSZXRPY2NZUlI4aFEKVHR2eG53c3BhL1hBdU9qcWZWNzIrSEVYMytSSFVhY0hMU3Q0TjFOOUpwZzlzcDVTVHdnclNyWDNibDJqUDhFVQo0SVFYdzNzbTFwNFVCNjRsaGhVQ0F3RUFBYU5DTUVBd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0hRWURWUjBPQkJZRUZBazNVV0szTVRHbmFvd2J2RTNuOHUrbXRDMzBNQTBHQ1NxR1NJYjMKRFFFQkN3VUFBNElCQVFDcUNmdkpsN29YQmZ1WFRSeWF1VXFYZmZER1RmYVBrTUc1VFdIcEl4bXNzN1VnSzJJOApxekJSTDlPUGJhcHh2TUNZRFNhKzBrcjlVKytjK3lqS00vYms0RURsajI3NldheXBpb2VhV2NTYTZHMGRWRXQ2Ck1hUWM0anVId1I3RldEbkhnbDhTYTJvOXJIeW8vOXcwY05RYkFwNjhkNFJXTDNQNGhJbE1sV2hCR3ZNWmxZazIKWUtvd3hLUHlPNStiY3NNaXIyMWZHcmUra2laV2U4T05PTk1QeDlSZldyaENZZ1NhV1dwbzlOc2Eybk1NbzFOQQpjemVjeU5HTTJudWdXSGdxWkxUbUYwY25KVzQ3OFRSNkIwLzJVMkp2OTlGVS9uR3hzYWk0OUlFSnNoY0hkVUowCkZwQUtET2txbmlaME9nQVRGWG9JN3MwQjB5QkNpZm8xWC9YNAotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
            },
        ] -> (known after apply)
      ~ created_at                = "2021-08-24 02:08:31.864 +0000 UTC" -> (known after apply)
      ~ enabled_cluster_log_types = [] -> (known after apply)
      ~ endpoint                  = "https://0F5C250AF28638C8C818D1C9031677F6.gr7.ap-southeast-2.eks.amazonaws.com" -> (known after apply)
      ~ id                        = "mlops-eks" -> (known after apply)
      ~ identity                  = [
          - {
              - oidc = [
                  - {
                      - issuer = "https://oidc.eks.ap-southeast-2.amazonaws.com/id/0F5C250AF28638C8C818D1C9031677F6"
                    },
                ]
            },
        ] -> (known after apply)
      ~ kubernetes_network_config = [
          - {
              - service_ipv4_cidr = "172.20.0.0/16"
            },
        ] -> (known after apply)
      ~ name                      = "mlops-eks" -> (known after apply)
      ~ platform_version          = "eks.2" -> (known after apply)
      ~ role_arn                  = "arn:aws:iam::112227029085:role/mlops-eks20210824020807836000000001" -> (known after apply)
      ~ status                    = "ACTIVE" -> (known after apply)
      ~ tags                      = {
          - "Environment" = "test"
        } -> (known after apply)
      ~ version                   = "1.20" -> (known after apply)
      ~ vpc_config                = [
          - {
              - cluster_security_group_id = "sg-0e0dd3c89974cd6f6"
              - endpoint_private_access   = false
              - endpoint_public_access    = true
              - public_access_cidrs       = [
                  - "0.0.0.0/0",
                ]
              - security_group_ids        = [
                  - "sg-0959be01b385f8ab0",
                ]
              - subnet_ids                = [
                  - "subnet-02b7b75b8875b6f02",
                  - "subnet-06dff361d9daa34ea",
                  - "subnet-0a134ea213c4bf0e2",
                ]
              - vpc_id                    = "vpc-075b2168a8a54d959"
            },
        ] -> (known after apply)
    }

  # data.aws_eks_cluster_auth.cluster will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster_auth" "cluster"  {
      ~ id    = "mlops-eks" -> (known after apply)
      ~ name  = "mlops-eks" -> (known after apply)
      ~ token = (sensitive value)
    }

  # module.eks.data.http.wait_for_cluster[0] will be read during apply
  # (config refers to values not yet known)
 <= data "http" "wait_for_cluster"  {
      ~ body             = "ok" -> (known after apply)
      ~ ca_certificate   = <<-EOT
            -----BEGIN CERTIFICATE-----
            MIIC5zCCAc+gAwIBAgIBADANBgkqhkiG9w0BAQsFADAVMRMwEQYDVQQDEwprdWJl
            cm5ldGVzMB4XDTIxMDgyNDAyMTQ1NVoXDTMxMDgyMjAyMTQ1NVowFTETMBEGA1UE
            AxMKa3ViZXJuZXRlczCCASIwDQYJKoZIhvcNAQEBBQADggEPADCCAQoCggEBAMBX
            /yxg37cpUj8HM0HXrWvoIxym4V2iHipQZJXD7JWHrS7itkbLzifpB9q61tkxx6Ix
            oRZxxRivJZPQyiyGp8NPXTvP/dqsYSv6QeIPDV7rxseiC5VoSGIG6HbIRL1D6rWZ
            3JfI6xgTVC7KNd8gjwMKNfr4DovTV4o/6giklO+thtmXDt2UTc7o72YStZ+uhXQx
            XkEb1PiFqm3wGnKr/hsX74UJtI/wrkCwFr8qoPGSpiHk7McWNdOURetOccYRR8hQ
            Ttvxnwspa/XAuOjqfV72+HEX3+RHUacHLSt4N1N9Jpg9sp5STwgrSrX3bl2jP8EU
            4IQXw3sm1p4UB64lhhUCAwEAAaNCMEAwDgYDVR0PAQH/BAQDAgKkMA8GA1UdEwEB
            /wQFMAMBAf8wHQYDVR0OBBYEFAk3UWK3MTGnaowbvE3n8u+mtC30MA0GCSqGSIb3
            DQEBCwUAA4IBAQCqCfvJl7oXBfuXTRyauUqXffDGTfaPkMG5TWHpIxmss7UgK2I8
            qzBRL9OPbapxvMCYDSa+0kr9U++c+yjKM/bk4EDlj276WaypioeaWcSa6G0dVEt6
            MaQc4juHwR7FWDnHgl8Sa2o9rHyo/9w0cNQbAp68d4RWL3P4hIlMlWhBGvMZlYk2
            YKowxKPyO5+bcsMir21fGre+kiZWe8ONONMPx9RfWrhCYgSaWWpo9Nsa2nMMo1NA
            czecyNGM2nugWHgqZLTmF0cnJW478TR6B0/2U2Jv99FU/nGxsai49IEJshcHdUJ0
            FpAKDOkqniZ0OgATFXoI7s0B0yBCifo1X/X4
            -----END CERTIFICATE-----
        EOT -> (known after apply)
      ~ id               = "https://0F5C250AF28638C8C818D1C9031677F6.gr7.ap-southeast-2.eks.amazonaws.com/healthz" -> (known after apply)
      - insecure         = false -> null
      ~ response_headers = {
          - "Cache-Control"                     = "no-cache, private"
          - "Content-Length"                    = "2"
          - "Content-Type"                      = "text/plain; charset=utf-8"
          - "Date"                              = "Tue, 24 Aug 2021 03:24:57 GMT"
          - "X-Content-Type-Options"            = "nosniff"
          - "X-Kubernetes-Pf-Flowschema-Uid"    = "89e83c64-e763-4601-bd41-6f7c3500e1e6"
          - "X-Kubernetes-Pf-Prioritylevel-Uid" = "65691fe1-f141-4828-876b-7eca3efb64bf"
        } -> (known after apply)
      ~ url              = "https://0F5C250AF28638C8C818D1C9031677F6.gr7.ap-southeast-2.eks.amazonaws.com/healthz" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.eks.aws_autoscaling_group.workers[0] will be updated in-place
  ~ resource "aws_autoscaling_group" "workers" {
        id                        = "mlops-eks-worker-group-120210824021938282500000011"
      ~ launch_configuration      = "mlops-eks-worker-group-120210824021923324500000010" -> (known after apply)
        name                      = "mlops-eks-worker-group-120210824021938282500000011"
      ~ vpc_zone_identifier       = [
          + "subnet-00dd6ad17f28e0110",
          + "subnet-073345847327cab44",
          + "subnet-0aff3cd4393d112eb",
            # (3 unchanged elements hidden)
        ]
        # (22 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.eks.aws_autoscaling_group.workers[1] will be updated in-place
  ~ resource "aws_autoscaling_group" "workers" {
        id                        = "mlops-eks-worker-group-220210824021938292400000012"
      ~ launch_configuration      = "mlops-eks-worker-group-22021082402192332450000000f" -> (known after apply)
        name                      = "mlops-eks-worker-group-220210824021938292400000012"
      ~ vpc_zone_identifier       = [
          + "subnet-00dd6ad17f28e0110",
          + "subnet-073345847327cab44",
          + "subnet-0aff3cd4393d112eb",
            # (3 unchanged elements hidden)
        ]
        # (22 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.eks.aws_eks_cluster.this[0] must be replaced
+/- resource "aws_eks_cluster" "this" {
      ~ arn                       = "arn:aws:eks:ap-southeast-2:112227029085:cluster/mlops-eks" -> (known after apply)
      ~ certificate_authority     = [
          - {
              - data = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUM1ekNDQWMrZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJeE1EZ3lOREF5TVRRMU5Wb1hEVE14TURneU1qQXlNVFExTlZvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBTUJYCi95eGczN2NwVWo4SE0wSFhyV3ZvSXh5bTRWMmlIaXBRWkpYRDdKV0hyUzdpdGtiTHppZnBCOXE2MXRreHg2SXgKb1JaeHhSaXZKWlBReWl5R3A4TlBYVHZQL2Rxc1lTdjZRZUlQRFY3cnhzZWlDNVZvU0dJRzZIYklSTDFENnJXWgozSmZJNnhnVFZDN0tOZDhnandNS05mcjREb3ZUVjRvLzZnaWtsTyt0aHRtWER0MlVUYzdvNzJZU3RaK3VoWFF4ClhrRWIxUGlGcW0zd0duS3IvaHNYNzRVSnRJL3dya0N3RnI4cW9QR1NwaUhrN01jV05kT1VSZXRPY2NZUlI4aFEKVHR2eG53c3BhL1hBdU9qcWZWNzIrSEVYMytSSFVhY0hMU3Q0TjFOOUpwZzlzcDVTVHdnclNyWDNibDJqUDhFVQo0SVFYdzNzbTFwNFVCNjRsaGhVQ0F3RUFBYU5DTUVBd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0hRWURWUjBPQkJZRUZBazNVV0szTVRHbmFvd2J2RTNuOHUrbXRDMzBNQTBHQ1NxR1NJYjMKRFFFQkN3VUFBNElCQVFDcUNmdkpsN29YQmZ1WFRSeWF1VXFYZmZER1RmYVBrTUc1VFdIcEl4bXNzN1VnSzJJOApxekJSTDlPUGJhcHh2TUNZRFNhKzBrcjlVKytjK3lqS00vYms0RURsajI3NldheXBpb2VhV2NTYTZHMGRWRXQ2Ck1hUWM0anVId1I3RldEbkhnbDhTYTJvOXJIeW8vOXcwY05RYkFwNjhkNFJXTDNQNGhJbE1sV2hCR3ZNWmxZazIKWUtvd3hLUHlPNStiY3NNaXIyMWZHcmUra2laV2U4T05PTk1QeDlSZldyaENZZ1NhV1dwbzlOc2Eybk1NbzFOQQpjemVjeU5HTTJudWdXSGdxWkxUbUYwY25KVzQ3OFRSNkIwLzJVMkp2OTlGVS9uR3hzYWk0OUlFSnNoY0hkVUowCkZwQUtET2txbmlaME9nQVRGWG9JN3MwQjB5QkNpZm8xWC9YNAotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
            },
        ] -> (known after apply)
      ~ created_at                = "2021-08-24 02:08:31.864 +0000 UTC" -> (known after apply)
      - enabled_cluster_log_types = [] -> null
      ~ endpoint                  = "https://0F5C250AF28638C8C818D1C9031677F6.gr7.ap-southeast-2.eks.amazonaws.com" -> (known after apply)
      ~ id                        = "mlops-eks" -> (known after apply)
      ~ identity                  = [
          - {
              - oidc = [
                  - {
                      - issuer = "https://oidc.eks.ap-southeast-2.amazonaws.com/id/0F5C250AF28638C8C818D1C9031677F6"
                    },
                ]
            },
        ] -> (known after apply)
        name                      = "mlops-eks"
      ~ platform_version          = "eks.2" -> (known after apply)
      ~ status                    = "ACTIVE" -> (known after apply)
        tags                      = {
            "Environment" = "test"
        }
        # (3 unchanged attributes hidden)

      ~ kubernetes_network_config {
          ~ service_ipv4_cidr = "172.20.0.0/16" -> (known after apply)
        }


      ~ vpc_config {
          ~ cluster_security_group_id = "sg-0e0dd3c89974cd6f6" -> (known after apply)
          ~ subnet_ids                = [ # forces replacement
              + "subnet-00dd6ad17f28e0110",
              + "subnet-073345847327cab44",
              + "subnet-0aff3cd4393d112eb",
                # (3 unchanged elements hidden)
            ]
          ~ vpc_id                    = "vpc-075b2168a8a54d959" -> (known after apply)
            # (4 unchanged attributes hidden)
        }
        # (1 unchanged block hidden)
    }

  # module.eks.aws_launch_configuration.workers[0] must be replaced
+/- resource "aws_launch_configuration" "workers" {
      ~ arn                              = "arn:aws:autoscaling:ap-southeast-2:112227029085:launchConfiguration:67f9eeab-2ca4-425c-8daf-71304dcafe68:launchConfigurationName/mlops-eks-worker-group-120210824021923324500000010" -> (known after apply)
      ~ associate_public_ip_address      = false -> true # forces replacement
      ~ id                               = "mlops-eks-worker-group-120210824021923324500000010" -> (known after apply)
      ~ name                             = "mlops-eks-worker-group-120210824021923324500000010" -> (known after apply)
      ~ user_data_base64                 = "IyEvYmluL2Jhc2ggLWUKCiMgQWxsb3cgdXNlciBzdXBwbGllZCBwcmUgdXNlcmRhdGEgY29kZQoKCiMgQm9vdHN0cmFwIGFuZCBqb2luIHRoZSBjbHVzdGVyCi9ldGMvZWtzL2Jvb3RzdHJhcC5zaCAtLWI2NC1jbHVzdGVyLWNhICdMUzB0TFMxQ1JVZEpUaUJEUlZKVVNVWkpRMEZVUlMwdExTMHRDazFKU1VNMWVrTkRRV01yWjBGM1NVSkJaMGxDUVVSQlRrSm5hM0ZvYTJsSE9YY3dRa0ZSYzBaQlJFRldUVkpOZDBWUldVUldVVkZFUlhkd2NtUlhTbXdLWTIwMWJHUkhWbnBOUWpSWVJGUkplRTFFWjNsT1JFRjVUVlJSTVU1V2IxaEVWRTE0VFVSbmVVMXFRWGxOVkZFeFRsWnZkMFpVUlZSTlFrVkhRVEZWUlFwQmVFMUxZVE5XYVZwWVNuVmFXRkpzWTNwRFEwRlRTWGRFVVZsS1MyOWFTV2gyWTA1QlVVVkNRbEZCUkdkblJWQkJSRU5EUVZGdlEyZG5SVUpCVFVKWUNpOTVlR2N6TjJOd1ZXbzRTRTB3U0ZoeVYzWnZTWGg1YlRSV01tbElhWEJSV2twWVJEZEtWMGh5VXpkcGRHdGlUSHBwWm5CQ09YRTJNWFJyZUhnMlNYZ0tiMUphZUhoU2FYWktXbEJSZVdsNVIzQTRUbEJZVkhaUUwyUnhjMWxUZGpaUlpVbFFSRlkzY25oelpXbEROVlp2VTBkSlJ6WklZa2xTVERGRU5uSlhXZ296U21aSk5uaG5WRlpETjB0T1pEaG5hbmROUzA1bWNqUkViM1pVVmpSdkx6Wm5hV3RzVHl0MGFIUnRXRVIwTWxWVVl6ZHZOekpaVTNSYUszVm9XRkY0Q2xoclJXSXhVR2xHY1cwemQwZHVTM0l2YUhOWU56UlZTblJKTDNkeWEwTjNSbkk0Y1c5UVIxTndhVWhyTjAxalYwNWtUMVZTWlhSUFkyTlpVbEk0YUZFS1ZIUjJlRzUzYzNCaEwxaEJkVTlxY1daV056SXJTRVZZTXl0U1NGVmhZMGhNVTNRMFRqRk9PVXB3WnpsemNEVlRWSGRuY2xOeVdETmliREpxVURoRlZRbzBTVkZZZHpOemJURndORlZDTmpSc2FHaFZRMEYzUlVGQllVNURUVVZCZDBSbldVUldVakJRUVZGSUwwSkJVVVJCWjB0clRVRTRSMEV4VldSRmQwVkNDaTkzVVVaTlFVMUNRV1k0ZDBoUldVUldVakJQUWtKWlJVWkJhek5WVjBzelRWUkhibUZ2ZDJKMlJUTnVPSFVyYlhSRE16Qk5RVEJIUTFOeFIxTkpZak1LUkZGRlFrTjNWVUZCTkVsQ1FWRkRjVU5tZGtwc04yOVlRbVoxV0ZSU2VXRjFWWEZZWm1aRVIxUm1ZVkJyVFVjMVZGZEljRWw0YlhOek4xVm5TekpKT0FweGVrSlNURGxQVUdKaGNIaDJUVU5aUkZOaEt6QnJjamxWS3l0akszbHFTMDB2WW1zMFJVUnNhakkzTmxkaGVYQnBiMlZoVjJOVFlUWkhNR1JXUlhRMkNrMWhVV00wYW5WSWQxSTNSbGRFYmtobmJEaFRZVEp2T1hKSWVXOHZPWGN3WTA1UllrRndOamhrTkZKWFRETlFOR2hKYkUxc1YyaENSM1pOV214WmF6SUtXVXR2ZDNoTFVIbFBOU3RpWTNOTmFYSXlNV1pIY21VcmEybGFWMlU0VDA1UFRrMVFlRGxTWmxkeWFFTlpaMU5oVjFkd2J6bE9jMkV5YmsxTmJ6Rk9RUXBqZW1WamVVNUhUVEp1ZFdkWFNHZHhXa3hVYlVZd1kyNUtWelEzT0ZSU05rSXdMekpWTWtwMk9UbEdWUzl1UjNoellXazBPVWxGU25Ob1kwaGtWVW93Q2tad1FVdEVUMnR4Ym1sYU1FOW5RVlJHV0c5Sk4zTXdRakI1UWtOcFptOHhXQzlZTkFvdExTMHRMVVZPUkNCRFJWSlVTVVpKUTBGVVJTMHRMUzB0Q2c9PScgLS1hcGlzZXJ2ZXItZW5kcG9pbnQgJ2h0dHBzOi8vMEY1QzI1MEFGMjg2MzhDOEM4MThEMUM5MDMxNjc3RjYuZ3I3LmFwLXNvdXRoZWFzdC0yLmVrcy5hbWF6b25hd3MuY29tJyAgLS1rdWJlbGV0LWV4dHJhLWFyZ3MgIiIgJ21sb3BzLWVrcycKCiMgQWxsb3cgdXNlciBzdXBwbGllZCB1c2VyZGF0YSBjb2RlCgo=" -> (known after apply) # forces replacement
      - vpc_classic_link_security_groups = [] -> null
        # (8 unchanged attributes hidden)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ metadata_options {
          ~ http_put_response_hop_limit = 1 -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ root_block_device {
          ~ throughput            = 0 -> (known after apply)
            # (5 unchanged attributes hidden)
        }
    }

  # module.eks.aws_launch_configuration.workers[1] must be replaced
+/- resource "aws_launch_configuration" "workers" {
      ~ arn                              = "arn:aws:autoscaling:ap-southeast-2:112227029085:launchConfiguration:6ca1294f-d54e-481f-8385-681f3dcd2fdb:launchConfigurationName/mlops-eks-worker-group-22021082402192332450000000f" -> (known after apply)
      ~ id                               = "mlops-eks-worker-group-22021082402192332450000000f" -> (known after apply)
      ~ name                             = "mlops-eks-worker-group-22021082402192332450000000f" -> (known after apply)
      ~ user_data_base64                 = "IyEvYmluL2Jhc2ggLWUKCiMgQWxsb3cgdXNlciBzdXBwbGllZCBwcmUgdXNlcmRhdGEgY29kZQoKCiMgQm9vdHN0cmFwIGFuZCBqb2luIHRoZSBjbHVzdGVyCi9ldGMvZWtzL2Jvb3RzdHJhcC5zaCAtLWI2NC1jbHVzdGVyLWNhICdMUzB0TFMxQ1JVZEpUaUJEUlZKVVNVWkpRMEZVUlMwdExTMHRDazFKU1VNMWVrTkRRV01yWjBGM1NVSkJaMGxDUVVSQlRrSm5hM0ZvYTJsSE9YY3dRa0ZSYzBaQlJFRldUVkpOZDBWUldVUldVVkZFUlhkd2NtUlhTbXdLWTIwMWJHUkhWbnBOUWpSWVJGUkplRTFFWjNsT1JFRjVUVlJSTVU1V2IxaEVWRTE0VFVSbmVVMXFRWGxOVkZFeFRsWnZkMFpVUlZSTlFrVkhRVEZWUlFwQmVFMUxZVE5XYVZwWVNuVmFXRkpzWTNwRFEwRlRTWGRFVVZsS1MyOWFTV2gyWTA1QlVVVkNRbEZCUkdkblJWQkJSRU5EUVZGdlEyZG5SVUpCVFVKWUNpOTVlR2N6TjJOd1ZXbzRTRTB3U0ZoeVYzWnZTWGg1YlRSV01tbElhWEJSV2twWVJEZEtWMGh5VXpkcGRHdGlUSHBwWm5CQ09YRTJNWFJyZUhnMlNYZ0tiMUphZUhoU2FYWktXbEJSZVdsNVIzQTRUbEJZVkhaUUwyUnhjMWxUZGpaUlpVbFFSRlkzY25oelpXbEROVlp2VTBkSlJ6WklZa2xTVERGRU5uSlhXZ296U21aSk5uaG5WRlpETjB0T1pEaG5hbmROUzA1bWNqUkViM1pVVmpSdkx6Wm5hV3RzVHl0MGFIUnRXRVIwTWxWVVl6ZHZOekpaVTNSYUszVm9XRkY0Q2xoclJXSXhVR2xHY1cwemQwZHVTM0l2YUhOWU56UlZTblJKTDNkeWEwTjNSbkk0Y1c5UVIxTndhVWhyTjAxalYwNWtUMVZTWlhSUFkyTlpVbEk0YUZFS1ZIUjJlRzUzYzNCaEwxaEJkVTlxY1daV056SXJTRVZZTXl0U1NGVmhZMGhNVTNRMFRqRk9PVXB3WnpsemNEVlRWSGRuY2xOeVdETmliREpxVURoRlZRbzBTVkZZZHpOemJURndORlZDTmpSc2FHaFZRMEYzUlVGQllVNURUVVZCZDBSbldVUldVakJRUVZGSUwwSkJVVVJCWjB0clRVRTRSMEV4VldSRmQwVkNDaTkzVVVaTlFVMUNRV1k0ZDBoUldVUldVakJQUWtKWlJVWkJhek5WVjBzelRWUkhibUZ2ZDJKMlJUTnVPSFVyYlhSRE16Qk5RVEJIUTFOeFIxTkpZak1LUkZGRlFrTjNWVUZCTkVsQ1FWRkRjVU5tZGtwc04yOVlRbVoxV0ZSU2VXRjFWWEZZWm1aRVIxUm1ZVkJyVFVjMVZGZEljRWw0YlhOek4xVm5TekpKT0FweGVrSlNURGxQVUdKaGNIaDJUVU5aUkZOaEt6QnJjamxWS3l0akszbHFTMDB2WW1zMFJVUnNhakkzTmxkaGVYQnBiMlZoVjJOVFlUWkhNR1JXUlhRMkNrMWhVV00wYW5WSWQxSTNSbGRFYmtobmJEaFRZVEp2T1hKSWVXOHZPWGN3WTA1UllrRndOamhrTkZKWFRETlFOR2hKYkUxc1YyaENSM1pOV214WmF6SUtXVXR2ZDNoTFVIbFBOU3RpWTNOTmFYSXlNV1pIY21VcmEybGFWMlU0VDA1UFRrMVFlRGxTWmxkeWFFTlpaMU5oVjFkd2J6bE9jMkV5YmsxTmJ6Rk9RUXBqZW1WamVVNUhUVEp1ZFdkWFNHZHhXa3hVYlVZd1kyNUtWelEzT0ZSU05rSXdMekpWTWtwMk9UbEdWUzl1UjNoellXazBPVWxGU25Ob1kwaGtWVW93Q2tad1FVdEVUMnR4Ym1sYU1FOW5RVlJHV0c5Sk4zTXdRakI1UWtOcFptOHhXQzlZTkFvdExTMHRMVVZPUkNCRFJWSlVTVVpKUTBGVVJTMHRMUzB0Q2c9PScgLS1hcGlzZXJ2ZXItZW5kcG9pbnQgJ2h0dHBzOi8vMEY1QzI1MEFGMjg2MzhDOEM4MThEMUM5MDMxNjc3RjYuZ3I3LmFwLXNvdXRoZWFzdC0yLmVrcy5hbWF6b25hd3MuY29tJyAgLS1rdWJlbGV0LWV4dHJhLWFyZ3MgIiIgJ21sb3BzLWVrcycKCiMgQWxsb3cgdXNlciBzdXBwbGllZCB1c2VyZGF0YSBjb2RlCgo=" -> (known after apply) # forces replacement
      - vpc_classic_link_security_groups = [] -> null
        # (9 unchanged attributes hidden)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ metadata_options {
          ~ http_put_response_hop_limit = 1 -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ root_block_device {
          ~ throughput            = 0 -> (known after apply)
            # (5 unchanged attributes hidden)
        }
    }

  # module.eks.kubernetes_config_map.aws_auth[0] will be created
  + resource "kubernetes_config_map" "aws_auth" {
      + data = {
          + "mapAccounts" = jsonencode([])
          + "mapRoles"    = <<-EOT
                - "groups":
                  - "system:bootstrappers"
                  - "system:nodes"
                  "rolearn": "arn:aws:iam::112227029085:role/mlops-eks20210824021922484200000009"
                  "username": "system:node:{{EC2PrivateDNSName}}"
            EOT
          + "mapUsers"    = jsonencode([])
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app.kubernetes.io/managed-by" = "Terraform"
              + "terraform.io/module"          = "terraform-aws-modules.eks.aws"
            }
          + name             = "aws-auth"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.eks.local_file.kubeconfig[0] will be created
  + resource "local_file" "kubeconfig" {
      + content              = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0600"
      + filename             = "./kubeconfig_mlops-eks"
      + id                   = (known after apply)
    }

Plan: 5 to add, 2 to change, 3 to destroy.

Changes to Outputs:
  ~ cluster_endpoint    = "https://0F5C250AF28638C8C818D1C9031677F6.gr7.ap-southeast-2.eks.amazonaws.com" -> (known after apply)
  ~ cluster_id          = "mlops-eks" -> (known after apply)
  ~ config_map_aws_auth = [
      ~ {
          ~ id          = "kube-system/aws-auth" -> (known after apply)
          ~ metadata    = [
              ~ {
                  ~ generate_name    = "" -> null
                  ~ generation       = 0 -> (known after apply)
                  ~ resource_version = "7013" -> (known after apply)
                  ~ uid              = "eae411f4-bac4-44b2-9967-6da2434180cd" -> (known after apply)
                    # (4 unchanged elements hidden)
                },
            ]
            # (2 unchanged elements hidden)
        },
    ]
  ~ kubectl_config      = <<-EOT
        apiVersion: v1
        preferences: {}
        kind: Config
        
        clusters:
        - cluster:
            server: https://0F5C250AF28638C8C818D1C9031677F6.gr7.ap-southeast-2.eks.amazonaws.com
            certificate-authority-data: LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUM1ekNDQWMrZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJeE1EZ3lOREF5TVRRMU5Wb1hEVE14TURneU1qQXlNVFExTlZvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBTUJYCi95eGczN2NwVWo4SE0wSFhyV3ZvSXh5bTRWMmlIaXBRWkpYRDdKV0hyUzdpdGtiTHppZnBCOXE2MXRreHg2SXgKb1JaeHhSaXZKWlBReWl5R3A4TlBYVHZQL2Rxc1lTdjZRZUlQRFY3cnhzZWlDNVZvU0dJRzZIYklSTDFENnJXWgozSmZJNnhnVFZDN0tOZDhnandNS05mcjREb3ZUVjRvLzZnaWtsTyt0aHRtWER0MlVUYzdvNzJZU3RaK3VoWFF4ClhrRWIxUGlGcW0zd0duS3IvaHNYNzRVSnRJL3dya0N3RnI4cW9QR1NwaUhrN01jV05kT1VSZXRPY2NZUlI4aFEKVHR2eG53c3BhL1hBdU9qcWZWNzIrSEVYMytSSFVhY0hMU3Q0TjFOOUpwZzlzcDVTVHdnclNyWDNibDJqUDhFVQo0SVFYdzNzbTFwNFVCNjRsaGhVQ0F3RUFBYU5DTUVBd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0hRWURWUjBPQkJZRUZBazNVV0szTVRHbmFvd2J2RTNuOHUrbXRDMzBNQTBHQ1NxR1NJYjMKRFFFQkN3VUFBNElCQVFDcUNmdkpsN29YQmZ1WFRSeWF1VXFYZmZER1RmYVBrTUc1VFdIcEl4bXNzN1VnSzJJOApxekJSTDlPUGJhcHh2TUNZRFNhKzBrcjlVKytjK3lqS00vYms0RURsajI3NldheXBpb2VhV2NTYTZHMGRWRXQ2Ck1hUWM0anVId1I3RldEbkhnbDhTYTJvOXJIeW8vOXcwY05RYkFwNjhkNFJXTDNQNGhJbE1sV2hCR3ZNWmxZazIKWUtvd3hLUHlPNStiY3NNaXIyMWZHcmUra2laV2U4T05PTk1QeDlSZldyaENZZ1NhV1dwbzlOc2Eybk1NbzFOQQpjemVjeU5HTTJudWdXSGdxWkxUbUYwY25KVzQ3OFRSNkIwLzJVMkp2OTlGVS9uR3hzYWk0OUlFSnNoY0hkVUowCkZwQUtET2txbmlaME9nQVRGWG9JN3MwQjB5QkNpZm8xWC9YNAotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg==
          name: eks_mlops-eks
        
        contexts:
        - context:
            cluster: eks_mlops-eks
            user: eks_mlops-eks
          name: eks_mlops-eks
        
        current-context: eks_mlops-eks
        
        users:
        - name: eks_mlops-eks
          user:
            exec:
              apiVersion: client.authentication.k8s.io/v1alpha1
              command: aws-iam-authenticator
              args:
                - "token"
                - "-i"
                - "mlops-eks"
    EOT -> (known after apply)

```
</details>
*Pusher: @yushindkang, Action: `pull_request`*